app/Controllers/DilgController.php

SELECT *
FROM `dilg`
---
    public function status()
    {
        $dilgModel = new DilgModel();
        $data['dilg'] = $dilgModel->findAll();