app/Controllers/FileController.php

    public function showFiles()
    {
        $fileModel = new FileModel();
        $data['files'] = $fileModel->findAll();

        $announceModel = new AnnounceModel();
        $data['announcements'] = $announceModel->findAll();
---
SELECT *
FROM `files`
SELECT *
FROM `announcement`