app/Controllers/FullCalendar.php

SELECT *
FROM `events`
 LIMIT 10
---
    public function calendar() {

        $db      = \Config\Database::connect();
        $builder = $db->table('events');
        $query = $builder->select('*')
                    ->limit(10)->get();