app/Models/EventModel.php

SELECT *
FROM `events`
---
    public function getAllEvents()
    {
        return $this->findAll();